# BouChique June 8 - 13 July  Sales Data

In [1]:
import pandas as pd

In [2]:
data = pd.read_csv('Book1.csv')

In [3]:
data

           DATE ITEM  QTY   PAID      BAL  ITEM AMT COMMENTS
0    8 Jun 2020    L  1.0  15000      0.0     15000   Sheila
1    8 Jun 2020    T  1.0   9000      0.0      9000      NaN
2    9 Jun 2020    S  1.0  15000      0.0     15000      NaN
3    9 Jun 2020    L  1.0  15000      0.0     15000      NaN
4    9 Jun 2020    S  1.0  11000      0.0     11000      NaN
..          ...  ...  ...    ...      ...       ...      ...
88  11 Jul 2020  NaN  0.0   2000      0.0      2000      UNK
89  11 Jul 2020  NaN  0.0   2000      0.0      2000   Sherie
90  11 Jul 2020    C  1.0      0  20000.0     20000     Joan
91  13 Jul 2020    D  1.0  20000      0.0     20000      NaN
92  13 Jul 2020   SH  1.0  29000      0.0     29000      NaN

[93 rows x 7 columns]

In [4]:
data.ITEM.unique()

array(['L', 'T', 'S', 'J', 'C', 'SH', 'D', 'B', 'SL', nan], dtype=object)

### Item Codes
#### L - Leggings
#### T- Tops
#### D - Dresses
#### S - Shoes
#### J - Jeggings
#### C - Coats
#### SL - Short Leggings

### TOTAL ITEMS SOLD

In [7]:
data.groupby('ITEM')['QTY'].sum()

ITEM
B      1.0
C      7.0
D     10.0
J      5.0
L     33.0
S     21.0
SH     2.0
SL    11.0
T     17.0
Name: QTY, dtype: float64

#### Total Amount Sold Per Item (Jun 8 - July 13th)

In [6]:
data.groupby('ITEM')['QTY','ITEM AMT'].sum()

c:\users\matovu moses\appdata\local\programs\python\python37\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  """Entry point for launching an IPython kernel.

       QTY  ITEM AMT
ITEM
B      1.0     20000
C      7.0    125000
D     10.0    190000
J      5.0    112000
L     33.0    477000
S     21.0    286000
SH     2.0     64000
SL    11.0    109000
T     17.0    157000